# encoding: utf-8

module ZhongwenTools
  UNICODE_CAPS = {
    'Ā' => 'ā',
    'Á' => 'á',
    'Ǎ' => 'ǎ',
    'À' => 'à',
    'Ē' => 'ē',
    'É' => 'é',
    'Ě' => 'ě',
    'È' => 'è',
    'Ī' => 'ī',
    'Í' => 'í',
    'Ǐ' => 'ǐ',
    'Ì' => 'ì',
    'Ō' => 'ō',
    'Ó' => 'ó',
    'Ǒ' => 'ǒ',
    'Ò' => 'ò',
    'Ǖ' => 'ǖ', # using combining diatrical marks
    'Ǘ' => 'ǘ', # using combining diatrical marks
    'Ǚ' => 'ǚ', # using combining diatrical marks
    'Ǜ' => 'ǜ', # using combining diatrical marks
    'Ū' => 'ū',
    'Ú' => 'ú',
    'Ǔ' => 'ǔ',
    'Ù' => 'ù',
    "Ａ" => "ａ",
    "Ｂ" => "ｂ",
    "Ｃ" => "ｃ",
    "Ｄ" => "ｄ",
    "Ｅ" => "ｅ",
    "Ｆ" => "ｆ",
    "Ｇ" => "ｇ",
    "Ｈ" => "ｈ",
    "Ｉ" => "ｉ",
    "Ｊ" => "ｊ",
    "Ｋ" => "ｋ",
    "Ｌ" => "ｌ",
    "Ｍ" => "ｍ",
    "Ｎ" => "ｎ",
    "Ｏ" => "ｏ",
    "Ｐ" => "ｐ",
    "Ｑ" => "ｑ",
    "Ｒ" => "ｒ",
    "Ｓ" => "ｓ",
    "Ｔ" => "ｔ",
    "Ｕ" => "ｕ",
    "Ｖ" => "ｖ",
    "Ｗ" => "ｗ",
    "Ｘ" => "ｘ",
    "Ｙ" => "ｙ",
    "Ｚ" => "ｚ"
  }
end
